{
  "projects": "Projetos",
  "aboutMe": "A Pessoa Por Trás Do Código",
  "contact": "Contato",
  "welcome1": "Oi, eu sou",
  "welcome2": "e sou Desenvolvedor Frontend, moldando a web uma linha de código por vez.",
  "project1": {
    "title": "SoloDev",
    "description": "Uma plataforma de aprendizagem centralizada para estudantes de tecnologia acessarem resumos gerados por IA, exercícios, links de documentação e vídeos educacionais. Tudo em um só lugar."
  },
  "project2": {
    "title": "codeHire",
    "description": "Uma plataforma para profissionais de tecnologia criarem currículos otimizados para passar pelo ATS, com edição em tempo real, dicas de boas práticas, navegação fluida e persistência de dados."
  },
  "project3": {
    "title": "Sky Watch",
    "description": "Um aplicativo de clima com dados em tempo real. Possui recursos como busca por cidade, alternância entre °C/°F e gerenciamento de favoritos."
  },
  "deployed": "Publicado",
  "repository": "Repositório",
  "call": "Curtiu o que viu? Vamos conversar!",
  "linkedin": "Meu perfil no LinkedIn",
  "github": "Meu repositório no GitHub",
  "copied": "Copiado!",
  "download": "Baixar meu CV",
  "email": "Copiar email",
  "phone": "Copiar telefone",
  "cv": "/cv/RobertoFerraz_FrontEnd_PT.pdf",
  "light": "claro",
  "dark": "escuro",
  "html": "HTML foi a primeira tecnologia que aprendi quando comecei minha jornada em programação. Era tudo muito novo para mim, mas eu estava animado e orgulhoso de dar esse passo, mesmo sem saber o que vinha pela frente.",
  "css": "CSS aumentou um pouco a dificuldade depois do HTML. A avalanche de propriedades me confundiu no início, mas ver a mágica acontecendo no navegador me fez me apaixonar pela estilização. Era incrível ver mudanças visuais imediatas conforme eu escrevia o código.",
  "javascript": "Foi aqui que as coisas ficaram sérias! Aprendi sobre algoritmos e lógica e comecei a entender como as coisas funcionam nos bastidores. Foi desafiador, mas abriu minha mente para inúmeras possibilidades. Também explorei ferramentas como o Webpack para empacotamento, além do Git e do GitHub, que foram essenciais para controle de versão e colaboração desde o início. O JavaScript me fez enxergar a programação como uma maneira de resolver problemas do mundo real de forma programática.",
  "typescript": "No começo, fiquei um pouco apreensivo com a nova sintaxe, mas com o tempo, foi tranquilo incluí-la no meu código. Lidar com prop validation se tornou muito mais fácil, já que até então eu usava apenas PropTypes no React. Logo percebi o quanto o TypeScript é útil para garantir consistência e evitar erros futuros. Hoje, ele é uma parte essencial da minha stack.",
  "react": "O React foi como uma viagem ao espaço — ele otimizou completamente minha experiência no desenvolvimento. Tudo ficou mais dinâmico e organizado. Além disso, aprofundei meus conhecimentos com ferramentas como React Router, React Query e Framer Motion, que trouxeram fluidez e interatividade aos meus projetos. Também explorei o Zustand para gerenciamento de estado de forma simples e eficiente. Para melhorar ainda mais a performance e experiência de desenvolvimento, usei Vite e Vitest como parte essencial da minha stack com React.",
  "tailwind": "Tailwind é, sem dúvidas, uma das minhas ferramentas preferidas. Ele transformou tudo o que eu já sabia de CSS em algo mais prático e organizado. A velocidade com que consigo estilizar interfaces usando Tailwind fez com que eu adotasse a ferramenta em praticamente todos os meus projetos.",
  "next": "Next.js foi meu primeiro contato real com desenvolvimento back-end e continua sendo uma das ferramentas mais completas que já usei. Ele me permite construir aplicações completas do início ao fim, com SSR, otimização para SEO, rotas de API e muito mais. Além disso, o uso do i18next para internacionalização e do Vercel para deploy deixou meus projetos mais profissionais e prontos para produção.",
  "timeline": "A Jornada Até Agora",
  "click": "Cada tecnologia tem uma história! Clique nos ícones para descobrir como foi minha jornada aprendendo cada uma delas.",
  "personal1": "Sou uma pessoa calma, empática e comunicativa que valoriza estar em ambientes harmoniosos. Cuidar da minha saúde mental é uma grande prioridade, por isso medito todos os dias. Isso me ajuda a manter o foco, lidar com os desafios de forma serena e ter clareza na hora de resolver problemas.",
  "personal2": "Liberdade é meu bem mais precioso! Amo viajar, explorar novas culturas e aprender idiomas. Morei em Portugal e na Irlanda, onde alcancei um nível avançado de inglês. Essas experiências me tornaram mais adaptável e mente aberta, qualidades que levo tanto para a vida pessoal quanto para o ambiente de trabalho.",
  "personal3": "Se quiser me encontrar, provavelmente estarei em um coffee shop, apreciando um belo cappuccino enquanto estudo back-end, algo que tenho explorado recentemente para expandir meus conhecimentos como desenvolvedor. Sou uma pessoa curiosa e adoro aprender coisas novas, o que me mantém motivado, atento aos detalhes e pronto para colaborar com outras pessoas em soluções criativas."
}
