{
  "projects": "Projects",
  "aboutMe": "The Person Behind The Code",
  "contact": "Contact",
  "welcome1": "Hi I'm",
  "welcome2": "and I'm a Frontend Developer crafting the web, one line at a time.",
  "project1": {
    "title": "codeHire",
    "description": "A platform for tech professionals to create resumes optimized to pass ATS."
  },
  "project2": {
    "title": "Authentication Project",
    "description": "A Firebase-based auth system with email/password and Google login support."
  },
  "project3": {
    "title": "Sky Watch",
    "description": "An App that provides real-time weather data using WeatherAPI and GeolocationAPI."
  },
  "deployed": "Deployed",
  "repository": "Repository",
  "call": "Hit me up, let’s make things happen!",
  "linkedin": "My LinkedIn profile",
  "github": "My GitHub repository",
  "copied": "Copied!",
  "download": "Download my CV",
  "email": "Copy email address",
  "phone": "Copy phone number",
  "cv": "/cv/RobertoFerraz_FrontEnd_EN.pdf",
  "light": "light",
  "dark": "dark",
  "html": "HTML was the first technology I learned when I started my journey in programming. Everything was brand new to me, but I was excited and proud to take this step, even without knowing what was ahead.",
  "css": "CSS increased the difficulty a bit after HTML. The avalanche of properties was confusing at first, but seeing the magic happen in the browser made me fall in love with styling. It was amazing to see immediate visual changes as I wrote the code.",
  "javascript": "This is where things got serious! I learned about algorithms and logic and began to understand how things work behind the scenes. It was challenging, but it opened my mind to countless possibilities. I also explored tools like Webpack for bundling, as well as Git and GitHub, which were essential for version control and collaboration from the start. JavaScript made me see programming as a way to solve real-world problems programmatically.",
  "typescript": "At first, I was a bit hesitant about the new syntax, but over time it became easy to integrate into my code. Handling prop validation became much simpler, since I had only used PropTypes in React until then. I quickly realized how useful TypeScript is for ensuring consistency and preventing future errors. Today, it’s an essential part of my stack.",
  "react": "React felt like a journey into space — it completely optimized my development experience. Everything became more dynamic and organized. I also deepened my knowledge using tools like React Router, React Query, and Framer Motion, which brought fluidity and interactivity to my projects. Zustand was another powerful addition for simple and effective state management. To further improve performance and the development experience, I integrated Vite and Vitest as essential parts of my React stack.",
  "tailwind": "Tailwind is by far one of my favorite tools. It transformed everything I already knew about CSS into something more practical and organized. The speed at which I can style interfaces using Tailwind has made it a go-to in nearly all my projects.",
  "next": "Next.js was my first real contact with back-end development, and it’s still one of the most complete tools I’ve ever used. It allows me to build full applications from start to finish, with SSR, SEO optimization, API routes, and more. Plus, using i18next for internationalization and Vercel for deployment has made my projects more professional and production-ready.",
  "timeline": "The Journey So Far",
  "click": "Every technology has a story! Click on the icons to explore my journey of learning each one.",
  "personal1": "I am a calm, empathetic, and communicative person who truly appreciates being in a harmonious environment. Maintaining my mental health is very important to me, so I meditate daily to stay balanced.",
  "personal2": "Freedom is my most valuable treasure! My favorite hobby is traveling the world, exploring new cultures, and learning new languages. I lived in Portugal for 2 years and in Ireland for 3, where I reached an advanced level of English. Discovering new ways of thinking fulfills me as a person, and I’m always seeking to grow.",
  "personal3": "If you want to find me, chances are you’ll catch me at a coffee shop, enjoying a deliciously creamy cappuccino while trying to keep my Duolingo streak alive as I improve my Italian."
}
